Repository: melchips/flatfileanalyser
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: Can't get data when record has not been parsed
fr_fr: Impossible de retourner les données car l'enregistrement n'a pas encore été analysé

source: Can't tell if input is null when record has not been parsed
fr_fr: Impossible de déterminer si l'entrée est nulle car l'enregistrement n'a pas été analysé

source: Can't check for errors when record has not been parsed
fr_fr: Impossible de vérifier les erreurs car l'enregistrement n'a pas été analysé

source: Field
fr_fr: Champ

source: Size
fr_fr: Taille

source: mandatory (Y/N)
fr_fr: obligatoire (O/N)

source: Numerical field with letters
fr_fr: Champ numérique contenant des lettres

source: Empty mandatory field
fr_fr: Champ obligatoire vide

source: Empty field
fr_fr: Champ vide

source: No mapping file specified
fr_fr: Fichier mapping non précisé

source: Can't open mapping file specified ('%s')
fr_fr: Impossible d'ouvrir le fichier mapping spécifié ('%s')

source: unknown
fr_fr: inconnu

source: unspecified in format
fr_fr: non déterminé dans le format

source: Unknown
fr_fr: Inconnu

source: Hidden data
fr_fr: Données masquées

source: display only totals
fr_fr: afficher uniquement les totaux

source: Can't list files in specified directory ('%s')
fr_fr: Impossible d'obtenir la liste des fichiers du répertoire ('%s')

source: Record
fr_fr: Enregistrement

source: Totals
fr_fr: Totaux

source: illegal call
fr_fr: appel illégal

source: illegal dynamic function call
fr_fr: appel dynamique illégal de fonction

source: Language
fr_fr: Langue

source: Analysis results
fr_fr: Résultat de l'analyse

source: jump to source data form
fr_fr: saut rapide vers le formulaire des données source

source: Fields color code
fr_fr: Légende des couleurs de champs

source: optional
fr_fr: optionnel

source: mandatory
fr_fr: obligatoire

source: optional error
fr_fr: facultatif en erreur

source: mandatory error
fr_fr: obligatoire en erreur

source: Error raised
fr_fr: L'erreur suivante s'est produite

source: Error in script. Please check its format
fr_fr: Une erreur s'est produite dans votre script. Merci d'en vérifier le format

source: Nothing was returned by the script
fr_fr: Le script n'a rien retourné

source: Source data
fr_fr: Données source

source: Data format
fr_fr: Format des données

source: <b>compact</b> mode
fr_fr: mode <b>compact</b>

source: display <b>totals</b>
fr_fr: afficher les <b>totaux</b>

source: display <b>totals only</b>
fr_fr: afficher <b>uniquement les totaux</b>

source: hide each record <b>title</b>
fr_fr: masquer le <b>titre</b> de chaque enregistrement

source: hide lines with <b>undefined</b> format
fr_fr: masquer les lignes <b>inconnues</b>

source: display data <b>gaps</b>
fr_fr: afficher les zones <b>non définies</b> dans le format

source: Data charset
fr_fr: Encodage des données

source: none
fr_fr: aucun

source: in
fr_fr: en

source: Analyse
fr_fr: Analyser

source: advanced <b>scripting</b>
fr_fr: <b>scripting</b> avancé

source: PHP script
fr_fr: Script PHP

source: load sample script
fr_fr: charger un exemple

source: clear script
fr_fr: effacer le script

source: Script output
fr_fr: Sortie du script

source: <b>analyse</b> script output (instead of source data)
fr_fr: <b>analyser</b> la sortie du script (à la place des données source)

source: Get script output as file
fr_fr: Récupérer la sortie du script sous forme de fichier
